CREATE TABLE TestPage(
	tid int primary key identity(1,1) not null,
	tname1 NVARCHAR(20) not null,
	tname2 NVARCHAR(20) not null,
	tname3 NVARCHAR(20) not null,
	tname4 NVARCHAR(20) not null,
	tname5 NVARCHAR(20) not null,
	tname6 NVARCHAR(20) not null
);

INSERT INTO TestPage(tname1, tname2, tname3, tname4, tname5 ,tname6) 
VALUES
('дъ·з1', 'дъдъ·з1', 'дъдъдъ·з1', 'дъдъдъ·з1','дъдъдъдъ·з1', 'дъдъ·з·з·з·з1'),
('дъ·з2', 'дъдъ·з2', 'дъдъдъ·з2', 'дъдъдъ·з2','дъдъдъдъ·з2', 'дъдъ·з·з·з·з2'),
('дъ·з3', 'дъдъ·з3', 'дъдъдъ·з3', 'дъдъдъ·з3','дъдъдъдъ·з3', 'дъдъ·з·з·з·з3'),
('дъ·з4', 'дъдъ·з4', 'дъдъдъ·з4', 'дъдъдъ·з4','дъдъдъдъ·з4', 'дъдъ·з·з·з·з4'),
('дъ·з5', 'дъдъ·з5', 'дъдъдъ·з5', 'дъдъдъ·з5','дъдъдъдъ·з5', 'дъдъ·з·з·з·з5'),
('дъ·з6', 'дъдъ·з6', 'дъдъдъ·з6', 'дъдъдъ·з6','дъдъдъдъ·з6', 'дъдъ·з·з·з·з6'),
('дъ·з7', 'дъдъ·з7', 'дъдъдъ·з7', 'дъдъдъ·з7','дъдъдъдъ·з7', 'дъдъ·з·з·з·з7'),
('дъ·з8', 'дъдъ·з8', 'дъдъдъ·з8', 'дъдъдъ·з8','дъдъдъдъ·з8', 'дъдъ·з·з·з·з8'),
('дъ·з9', 'дъдъ·з9', 'дъдъдъ·з9', 'дъдъдъ·з9','дъдъдъдъ·з9', 'дъдъ·з·з·з·з9'),
('дъ·з10', 'дъдъ·з10', 'дъдъдъ·з10', 'дъдъдъ·з10','дъдъдъдъ·з10', 'дъдъ·з·з·з·з10'),
('дъ·з11', 'дъдъ·з11', 'дъдъдъ·з11', 'дъдъдъ·з11','дъдъдъдъ·з11', 'дъдъ·з·з·з·з11'),
('дъ·з12', 'дъдъ·з12', 'дъдъдъ·з12', 'дъдъдъ·з12','дъдъдъдъ·з12', 'дъдъ·з·з·з·з12'),
('дъ·з13', 'дъдъ·з13', 'дъдъдъ·з13', 'дъдъдъ·з13','дъдъдъдъ·з13', 'дъдъ·з·з·з·з13'),
('дъ·з14', 'дъдъ·з14', 'дъдъдъ·з14', 'дъдъдъ·з14','дъдъдъдъ·з14', 'дъдъ·з·з·з·з14'),
('дъ·з15', 'дъдъ·з15', 'дъдъдъ·з15', 'дъдъдъ·з15','дъдъдъдъ·з15', 'дъдъ·з·з·з·з15'),
('дъ·з16', 'дъдъ·з16', 'дъдъдъ·з16', 'дъдъдъ·з16','дъдъдъдъ·з16', 'дъдъ·з·з·з·з16'),
('дъ·з17', 'дъдъ·з17', 'дъдъдъ·з17', 'дъдъдъ·з17','дъдъдъдъ·з17', 'дъдъ·з·з·з·з17'),
('дъ·з18', 'дъдъ·з18', 'дъдъдъ·з18', 'дъдъдъ·з18','дъдъдъдъ·з18', 'дъдъ·з·з·з·з18'),
('дъ·з19', 'дъдъ·з19', 'дъдъдъ·з19', 'дъдъдъ·з19','дъдъдъдъ·з19', 'дъдъ·з·з·з·з19'),
('дъ·з20', 'дъдъ·з20', 'дъдъдъ·з20', 'дъдъдъ·з20','дъдъдъдъ·з20', 'дъдъ·з·з·з·з20'),
('дъ·з21', 'дъдъ·з21', 'дъдъдъ·з21', 'дъдъдъ·з21','дъдъдъдъ·з21', 'дъдъ·з·з·з·з21'),
('дъ·з22', 'дъдъ·з22', 'дъдъдъ·з22', 'дъдъдъ·з22','дъдъдъдъ·з22', 'дъдъ·з·з·з·з22'),
('дъ·з23', 'дъдъ·з23', 'дъдъдъ·з23', 'дъдъдъ·з23','дъдъдъдъ·з23', 'дъдъ·з·з·з·з23'),
('дъ·з24', 'дъдъ·з24', 'дъдъдъ·з24', 'дъдъдъ·з24','дъдъдъдъ·з24', 'дъдъ·з·з·з·з24')

SELECT *FROM TestPage