USE team6;
--創建表格
CREATE TABLE Delivery (
    delivery_id INT	IDENTITY PRIMARY KEY,
	order_id NVARCHAR(max) not null,
    date DATE,
    address NVARCHAR(MAX),
	status INT DEFAULT 1
);

--新增假資料
INSERT INTO delivery(order_id,date,address,status)
VALUES
('20240503120214','2024-05-03','桃園市中壢區健行路229號',4),
('20240503132324','2024-05-03','桃園市中壢區中華路一段267號',4),
('20240503181324','2024-05-03','桃園市中壢區中華路一段267號',4),
('20240504121115','2024-05-04','桃園市中壢區中北路200號',4),
('20240504141532','2024-05-04', '桃園市中壢區健行路229號',4),
('20240504153919','2024-05-04','桃園市中壢區中和路139號',4),
('20240504183345','2024-05-04','桃園市中壢區遠東路135號',4),
('20240504195802','2024-05-04','桃園市中壢區健行路229號',4),
('20240505114213','2024-05-05','桃園市中壢區健行路229號',4),
('20240505125426','2024-05-05','桃園市中壢區中華路一段267號',4),
('20240505160718','2024-05-05','桃園市中壢區健行路229號',4),
('20240505163312','2024-05-05','桃園市中壢區中和路139號',4),
('20240505170111','2024-05-05','桃園市中壢區健行路229號',4),
('20240505181709','2024-05-05','桃園市中壢區中和路139號',4),
('20240505200112','2024-05-05','桃園市中壢區健行路229號',1);
SELECT * FROM Delivery

--測試
UPDATE Delivery SET status = 2 WHERE delivery_id = 15;
SELECT * FROM Delivery

INSERT INTO Delivery(order_id,address) VALUES ('20240505200113', '桃園市中壢區健行路229號');